using System;

namespace transformation
{
    class Program
    {
        static void Main(string[] args)
        {

            /*
                1 Чтение файла по пути "C:\it-academy\files\image.txt"
                2 Читаем файл и возвращает строку
                3 Разбиваем строку по пробелу и дабавляем в массив
                4 Создаем пустой байтовый массив с длинной стринговова массива -1
                5 Освобождает все ресурсы, используемые объектом TextReader 
                6 Создаем цикл,от до конца массива с шагом 1
                7 Конвертация из стринга в байт и присвоение значения переменной
                8 Значение переменной добовляем в массив
                9 Создание файла, с помощью массива байтов и сохранение по указаному пути
            */
        }
    }
}
